In [108]:
import pandas  as pd
dados = pd.read_csv(r"/home/youx/youxlab-treino-git/Dados/venda-de-carros.csv")
dados

  Fabricante       Cor  Quilometragem  Portas          Preco
0     Toyota    Branco         150043       4   R$ 24,000.00
1      Honda  Vermelho          87899       4   R$ 25,000.00
2     Toyota      Azul          32549       3   R$ 27,000.00
3        BMW     Preto          11179       5  R$ 122,000.00
4     Nissan    Branco         213095       4   R$ 13,500.00
5     Toyota     Verde          99213       4   R$ 14,500.00
6      Honda      Azul          45698       4   R$ 17,500.00
7      Honda      Azul          54738       4   R$ 27,000.00
8     Toyota    Branco          60000       4   R$ 26,250.00
9     Nissan    Branco          31600       4   R$ 19,700.00

In [109]:

jogos = pd.DataFrame({
    'nome': ['red Read Redemption 2', 'GTA 6', 'Gta San Andreas'],
    'Lançamento': [2018, 2013, 2003],
    'Downloads': [60000000, 50000000, 60000000]
})

print(jogos['nome'])
jogos

0    red Read Redemption 2
1                    GTA 6
2          Gta San Andreas
Name: nome, dtype: object

                    nome  Lançamento  Downloads
0  red Read Redemption 2        2018   60000000
1                  GTA 6        2013   50000000
2        Gta San Andreas        2003   60000000

In [110]:
jogos.columns

Index(['nome', 'Lançamento', 'Downloads'], dtype='object')

In [111]:
#jogos = list(jogos)
#jogos

In [112]:
jogos_renomeado = jogos.rename(columns={
    'nome': 'Nome Jogos',
    'Lançamento': 'Novo Lançamento'
})

jogos_renomeado

              Nome Jogos  Novo Lançamento  Downloads
0  red Read Redemption 2             2018   60000000
1                  GTA 6             2013   50000000
2        Gta San Andreas             2003   60000000

In [113]:
jogos.rename(columns={
    "nome": 'Games',
    "Lançamento": 'Antigos Lançamentos'
},
inplace=True)

jogos

                   Games  Antigos Lançamentos  Downloads
0  red Read Redemption 2                 2018   60000000
1                  GTA 6                 2013   50000000
2        Gta San Andreas                 2003   60000000

In [114]:
jogos.columns = ['Joguinhos', 'Estourados', 'Baixados']

jogos

               Joguinhos  Estourados  Baixados
0  red Read Redemption 2        2018  60000000
1                  GTA 6        2013  50000000
2        Gta San Andreas        2003  60000000

In [115]:
print(dados['Fabricante'])
type(dados['Fabricante'])

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Fabricante, dtype: object

pandas.core.series.Series

In [116]:
series1 = pd.Series([5.5,6.0,9.5])
series1

0    5.5
1    6.0
2    9.5
dtype: float64

In [117]:
series1 = pd.Series([5.5,6.0,9.5], index=['Prova 1', 'Prova 2', 'Prova 3'], name='Notas do Arthur Morgan')
series1

Prova 1    5.5
Prova 2    6.0
Prova 3    9.5
Name: Notas do Arthur Morgan, dtype: float64

In [118]:
cor_copia = dados['Cor'].copy
cor_copia

<bound method NDFrame.copy of 0      Branco
1    Vermelho
2        Azul
3       Preto
4      Branco
5       Verde
6        Azul
7        Azul
8      Branco
9      Branco
Name: Cor, dtype: object>

In [119]:
series1 = pd.Series([9.5,11.0,15.5], index=['Prova 1', 'Prova 2', 'Prova 3'], name='Notas do Arthur Morgan')
series2 = pd.Series([8.0,10.3,12.3], index=['Prova 1', 'Prova 2', 'Prova 3'], name='Notas do Jhon')

dados_series = pd.concat([series1, series2], axis=1)
dados_series

         Notas do Arthur Morgan  Notas do Jhon
Prova 1                     9.5            8.0
Prova 2                    11.0           10.3
Prova 3                    15.5           12.3

In [120]:
dados['Nova Coluna'] = 'Testando'
dados['Quilometragem 2'] = dados['Quilometragem'] * 5 # Multiplica por 5 o valor da quilometragem
dados

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
0,Toyota,Branco,150043,4,"R$ 24,000.00",Testando,750215
1,Honda,Vermelho,87899,4,"R$ 25,000.00",Testando,439495
2,Toyota,Azul,32549,3,"R$ 27,000.00",Testando,162745
3,BMW,Preto,11179,5,"R$ 122,000.00",Testando,55895
4,Nissan,Branco,213095,4,"R$ 13,500.00",Testando,1065475
5,Toyota,Verde,99213,4,"R$ 14,500.00",Testando,496065
6,Honda,Azul,45698,4,"R$ 17,500.00",Testando,228490
7,Honda,Azul,54738,4,"R$ 27,000.00",Testando,273690
8,Toyota,Branco,60000,4,"R$ 26,250.00",Testando,300000
9,Nissan,Branco,31600,4,"R$ 19,700.00",Testando,158000

In [121]:
print(dados)
dados.iloc[1]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

   Quilometragem 2
0           750215
1           439495
2           162745
3            55895
4          1065475
5           496065
6           228490
7           273690
8           300000
9           158000

Fabricante                Honda
Cor                    Vermelho
Quilometragem             87899
Portas                        4
Preco              R$ 25,000.00
Nova Coluna            Testando
Quilometragem 2          439495
Name: 1, dtype: object

In [122]:
print(dados)
dados.iloc[4:6]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

   Quilometragem 2
0           750215
1           439495
2           162745
3            55895
4          1065475
5           496065
6           228490
7           273690
8           300000
9           158000

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
4,Nissan,Branco,213095,4,"R$ 13,500.00",Testando,1065475
5,Toyota,Verde,99213,4,"R$ 14,500.00",Testando,496065

In [123]:
print(dados)
dados.iloc[4:6, 1]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

   Quilometragem 2
0           750215
1           439495
2           162745
3            55895
4          1065475
5           496065
6           228490
7           273690
8           300000
9           158000

4    Branco
5     Verde
Name: Cor, dtype: object

In [124]:
print(dados)
dados.iloc[4]

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

   Quilometragem 2
0           750215
1           439495
2           162745
3            55895
4          1065475
5           496065
6           228490
7           273690
8           300000
9           158000

Fabricante               Nissan
Cor                      Branco
Quilometragem            213095
Portas                        4
Preco              R$ 13,500.00
Nova Coluna            Testando
Quilometragem 2         1065475
Name: 4, dtype: object

In [125]:
print(dados)
dados.loc[4:6, 'Fabricante']

  Fabricante       Cor  Quilometragem  Portas          Preco Nova Coluna  \
0     Toyota    Branco         150043       4   R$ 24,000.00    Testando
1      Honda  Vermelho          87899       4   R$ 25,000.00    Testando
2     Toyota      Azul          32549       3   R$ 27,000.00    Testando
3        BMW     Preto          11179       5  R$ 122,000.00    Testando
4     Nissan    Branco         213095       4   R$ 13,500.00    Testando
5     Toyota     Verde          99213       4   R$ 14,500.00    Testando
6      Honda      Azul          45698       4   R$ 17,500.00    Testando
7      Honda      Azul          54738       4   R$ 27,000.00    Testando
8     Toyota    Branco          60000       4   R$ 26,250.00    Testando
9     Nissan    Branco          31600       4   R$ 19,700.00    Testando

   Quilometragem 2
0           750215
1           439495
2           162745
3            55895
4          1065475
5           496065
6           228490
7           273690
8           300000
9           158000

4    Nissan
5    Toyota
6     Honda
Name: Fabricante, dtype: object

In [126]:
dados[['Fabricante', 'Cor', 'Quilometragem']]

  Fabricante       Cor  Quilometragem
0     Toyota    Branco         150043
1      Honda  Vermelho          87899
2     Toyota      Azul          32549
3        BMW     Preto          11179
4     Nissan    Branco         213095
5     Toyota     Verde          99213
6      Honda      Azul          45698
7      Honda      Azul          54738
8     Toyota    Branco          60000
9     Nissan    Branco          31600

In [127]:

del dados['Quilometregem 2']
dados

KeyError: 'Quilometregem 2'

In [ ]:
dados['Fabricante'].unique()

array(['Toyota', 'Honda', 'BMW', 'Nissan'], dtype=object)

In [136]:
dados_filtrados = dados.query('Fabricante == "Honda"')
dados_filtrados

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
1,Honda,Vermelho,87899,4,"R$ 25,000.00",Testando,439495
6,Honda,Azul,45698,4,"R$ 17,500.00",Testando,228490
7,Honda,Azul,54738,4,"R$ 27,000.00",Testando,273690

In [ ]:
dados_filtrados2 = dados.query('Fabricante == "Honda" and Cor == "Azul"').reset_index
dados_filtrados2

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
6,Honda,Azul,45698,4,"R$ 17,500.00",Testando,228490
7,Honda,Azul,54738,4,"R$ 27,000.00",Testando,273690

In [139]:
dados_filtrados3 = dados[dados['Fabricante'] == "Honda"]
dados_filtrados3

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
1,Honda,Vermelho,87899,4,"R$ 25,000.00",Testando,439495
6,Honda,Azul,45698,4,"R$ 17,500.00",Testando,228490
7,Honda,Azul,54738,4,"R$ 27,000.00",Testando,273690

In [140]:
dados_filtrados4 = dados[(dados['Fabricante'] == "Honda") & (dados['Cor'] == "Azul")]
dados_filtrados4

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
6,Honda,Azul,45698,4,"R$ 17,500.00",Testando,228490
7,Honda,Azul,54738,4,"R$ 27,000.00",Testando,273690

In [142]:
lista_cor = ['Azul', 'Vermelho']
dados_filtrados5 = dados.query('Cor in @lista_cor')
dados_filtrados5

,Fabricante,Cor,Quilometragem,Portas,Preco,Nova Coluna,Quilometragem 2
1,Honda,Vermelho,87899,4,"R$ 25,000.00",Testando,439495
2,Toyota,Azul,32549,3,"R$ 27,000.00",Testando,162745
6,Honda,Azul,45698,4,"R$ 17,500.00",Testando,228490
7,Honda,Azul,54738,4,"R$ 27,000.00",Testando,273690

In [ ]:
dados.dropna() # remove todas as linhas vazias do DataFreme
dados.fillna() #preenche todos valores vazios de um DataFrame com 0.

In [ ]:
dados['Quilometragem'].describe() # Nos retorna a estatística descritiva como contagem, média, etc.

count        10.000000
mean      78601.400000
std       61983.471735
min       11179.000000
25%       35836.250000
50%       57369.000000
75%       96384.500000
max      213095.000000
Name: Quilometragem, dtype: float64

In [ ]:
print(dados['Quilometragem'].mean())
print(dados['Quilometragem'].sum())    
print(dados['Quilometragem'].std())      # Para calcular a média, soma, desvio padrão, min, max:
print(dados['Quilometragem'].min())
print(dados['Quilometragem'].max())

78601.4
786014
61983.47173454119
11179
213095

In [150]:
dados['Fabricante'].value_counts()

Fabricante
Toyota    4
Honda     3
Nissan    2
BMW       1
Name: count, dtype: int64

In [154]:
dados_fabricantes = dados['Fabricante'].value_counts().to_frame().reset_index()
dados_fabricantes

  Fabricante  count
0     Toyota      4
1      Honda      3
2     Nissan      2
3        BMW      1

In [43]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [10, 20, 30, 40],
                   'C': [100, 200, 300, 400]},
                  index=['Linha 1', 'Linha 2', 'Linha 3', 'Linha 4'])

df

         A   B    C
Linha 1  1  10  100
Linha 2  2  20  200
Linha 3  3  30  300
Linha 4  4  40  400

In [44]:
def nossa_soma(series):
    return series.sum()

In [45]:
df['SOMA (A, B, C)'] = df.apply(nossa_soma, axis=1)
df

         A   B    C  SOMA (A, B, C)
Linha 1  1  10  100             111
Linha 2  2  20  200             222
Linha 3  3  30  300             333
Linha 4  4  40  400             444

In [46]:
df.loc['Linha 5'] = df.apply(nossa_soma, axis=0)
df

          A    B     C  SOMA (A, B, C)
Linha 1   1   10   100             111
Linha 2   2   20   200             222
Linha 3   3   30   300             333
Linha 4   4   40   400             444
Linha 5  10  100  1000            1110

In [47]:
df['MEDIA(A, B, C)'] = df[['A', 'B', 'C']].apply(lambda series: series.mean(), axis=1)
df

          A    B     C  SOMA (A, B, C)  MEDIA(A, B, C)
Linha 1   1   10   100             111            37.0
Linha 2   2   20   200             222            74.0
Linha 3   3   30   300             333           111.0
Linha 4   4   40   400             444           148.0
Linha 5  10  100  1000            1110           370.0

In [48]:
df ['C * 2'] = df['C'].apply(lambda x: x * 2)
df

          A    B     C  SOMA (A, B, C)  MEDIA(A, B, C)  C * 2
Linha 1   1   10   100             111            37.0    200
Linha 2   2   20   200             222            74.0    400
Linha 3   3   30   300             333           111.0    600
Linha 4   4   40   400             444           148.0    800
Linha 5  10  100  1000            1110           370.0   2000

In [49]:
df['A * 2'] = df['A'] * 3
df

          A    B     C  SOMA (A, B, C)  MEDIA(A, B, C)  C * 2  A * 2
Linha 1   1   10   100             111            37.0    200      3
Linha 2   2   20   200             222            74.0    400      6
Linha 3   3   30   300             333           111.0    600      9
Linha 4   4   40   400             444           148.0    800     12
Linha 5  10  100  1000            1110           370.0   2000     30

In [ ]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4],
                   'B': [10, 20, 30, 40],
                   'C': [100, 200, 300, 400]}, 
                  index=['Linha 1', 'Linha 2', 'Linha 3', 'Linha 4'])

df

         A   B    C
Linha 1  1  10  100
Linha 2  2  20  200
Linha 3  3  30  300
Linha 4  4  40  400

In [55]:
df.applymap(lambda x: x **2)

/tmp/ipykernel_3538/393819654.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x **2)

          A     B       C
Linha 1   1   100   10000
Linha 2   4   400   40000
Linha 3   9   900   90000
Linha 4  16  1600  160000

In [56]:
nomes = pd.Series(['Pietro', 'Ana', 'Gustavo', 'Sophia'])
nomes

0     Pietro
1        Ana
2    Gustavo
3     Sophia
dtype: object

In [58]:
nomes.map(lambda x: x.upper())

0     PIETRO
1        ANA
2    GUSTAVO
3     SOPHIA
dtype: object